20230822073125-tcp_segment.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-02 Mon 08:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>TCP Segment</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">TCP Segment</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org00509d4">1. Header</a>
<ul>
<li><a href="#org2512097">1.1. Source port</a></li>
<li><a href="#org6fbfb81">1.2. Destination port</a></li>
<li><a href="#org1d8c2fc">1.3. Sequence number.</a></li>
<li><a href="#orge9e336e">1.4. Acknowledgement number.</a></li>
<li><a href="#orgfbdff5a">1.5. Data offset Field</a></li>
<li><a href="#org2a1473d">1.6. Control Flags</a></li>
<li><a href="#orga62b0d3">1.7. TCP Window</a></li>
<li><a href="#org23dc121">1.8. Checksum</a></li>
<li><a href="#org69d655c">1.9. Urgent Pointer</a></li>
<li><a href="#org2037f29">1.10. Options Pointer</a></li>
<li><a href="#org4499882">1.11. Padding</a></li>
</ul>
</li>
<li><a href="#org107d14f">2. Payload</a></li>
</ul>
</div>
</div>
<p>
Made up of:
</p>
<div id="outline-container-org00509d4" class="outline-2">
<h2 id="org00509d4"><span class="section-number-2">1.</span> Header</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org2512097" class="outline-3">
<h3 id="org2512097"><span class="section-number-3">1.1.</span> Source port</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<b>16-bits</b>
</p>

<p>
A high numbered port chosen from a special section of ports known as ephemeral ports.
Required to keep lots of outgoing connections separate.
</p>
</div>
</div>

<div id="outline-container-org6fbfb81" class="outline-3">
<h3 id="org6fbfb81"><span class="section-number-3">1.2.</span> Destination port</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<b>16-bits</b>
The port of the service the traffic is intended for.
</p>
</div>
</div>

<div id="outline-container-org1d8c2fc" class="outline-3">
<h3 id="org1d8c2fc"><span class="section-number-3">1.3.</span> Sequence number.</h3>
<div class="outline-text-3" id="text-1-3">
<p>
<b>32-bits</b>
Used to keep track of where in a sequence of <a href="20230819080017-transmission_control_protocol_tcp.html#ID-690db04e-097b-4e6c-8e78-92e353fc49da">TCP</a> segments this one is expected to be.
</p>

<p>
An <a href="20230821055442-ethernet_frame.html#ID-73b06fc5-e631-40ad-828f-741dd84bd15c">Ethernet Frame</a> is usually limited in size to <b>1,518 bytes</b>,
</p>
</div>
</div>

<div id="outline-container-orge9e336e" class="outline-3">
<h3 id="orge9e336e"><span class="section-number-3">1.4.</span> Acknowledgement number.</h3>
<div class="outline-text-3" id="text-1-4">
<p>
<b>32-bits</b>
Number of the next expected segment.
</p>
</div>
</div>

<div id="outline-container-orgfbdff5a" class="outline-3">
<h3 id="orgfbdff5a"><span class="section-number-3">1.5.</span> Data offset Field</h3>
<div class="outline-text-3" id="text-1-5">
<p>
<b>4-bit</b>
Communicates how long the <a href="20230819080017-transmission_control_protocol_tcp.html#ID-690db04e-097b-4e6c-8e78-92e353fc49da">TCP</a> header for this segment is.
</p>
</div>
</div>

<div id="outline-container-org2a1473d" class="outline-3">
<h3 id="org2a1473d"><span class="section-number-3">1.6.</span> Control Flags</h3>
<div class="outline-text-3" id="text-1-6">
<p>
<b>6-bits</b>
Reserved for the six <a href="20230822074622-tcp_control_flags.html#ID-b70de003-f81d-4b98-8158-46a9bb7e2039">TCP Control Flags</a>
</p>
</div>
</div>

<div id="outline-container-orga62b0d3" class="outline-3">
<h3 id="orga62b0d3"><span class="section-number-3">1.7.</span> TCP Window</h3>
<div class="outline-text-3" id="text-1-7">
<p>
A TCP window specifies the range of sequence numbers that might be sent before an acknowledgment is required.
</p>
</div>
</div>

<div id="outline-container-org23dc121" class="outline-3">
<h3 id="org23dc121"><span class="section-number-3">1.8.</span> Checksum</h3>
<div class="outline-text-3" id="text-1-8">
<p>
<b>16-bits</b>
Once all of this segment has been ingested by recipient, the checksum is calculated across the entire segment and is compared with the checksum in the header to make sure that there was no data lost or corruption along the way.
</p>
</div>
</div>

<div id="outline-container-org69d655c" class="outline-3">
<h3 id="org69d655c"><span class="section-number-3">1.9.</span> Urgent Pointer</h3>
<div class="outline-text-3" id="text-1-9">
<p>
<b>16-bits</b>
Used in conjuction with one of the TCP control flags to point out particular segments that might be more important than others.
</p>
</div>
</div>

<div id="outline-container-org2037f29" class="outline-3">
<h3 id="org2037f29"><span class="section-number-3">1.10.</span> Options Pointer</h3>
<div class="outline-text-3" id="text-1-10">
<p>
Sometimes used for more complicated flow control protocols.
</p>
</div>
</div>

<div id="outline-container-org4499882" class="outline-3">
<h3 id="org4499882"><span class="section-number-3">1.11.</span> Padding</h3>
<div class="outline-text-3" id="text-1-11">
<p>
Sequence of zeros to ensure that the data payload section begins at the expected location.
</p>
</div>
</div>
</div>

<div id="outline-container-org107d14f" class="outline-2">
<h2 id="org107d14f"><span class="section-number-2">2.</span> Payload</h2>
<div class="outline-text-2" id="text-2">
<p>
Contents of data application wants to send to each other
</p>
</div>
</div>
</div>
</body>
</html>
